---
kind: method
id: M:Autodesk.Revit.DB.FabricationPart.IsDimensionCalculated(Autodesk.Revit.DB.FabricationDimensionDefinition)
source: html/7a32b9cd-e77f-4121-9d59-5bc2a3882693.htm
---
# Autodesk.Revit.DB.FabricationPart.IsDimensionCalculated Method

Checks if the fabrication dimension is calculated.

## Syntax (C#)
```csharp
public bool IsDimensionCalculated(
	FabricationDimensionDefinition dim
)
```

## Parameters
- **dim** (`Autodesk.Revit.DB.FabricationDimensionDefinition`) - The fabrication dimension.

## Returns
True if the fabrication dimension is calculated.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null